Documents/Testing/Non-Functional Testing/Performance.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.1">
  <hashTree>

    <!-- Test Plan -->

    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Website Performance Test" enabled="true">
      <stringProp name="TestPlan.comments">
        Performance Test for Blogging Platform
      </stringProp>
      <boolProp name="TestPlan.functional_mode">
        false
      </boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">
        false
      </boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- Thread Group -->

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">
          continue
        </stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" enabled="true">
          <stringProp name="LoopController.loops">
            1
          </stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">
          10
        </stringProp> <!-- Total Users -->
        <stringProp name="ThreadGroup.ramp_time">
          10
        </stringProp> <!-- Ramp-up time -->
        <boolProp name="ThreadGroup.scheduler">
          false
        </boolProp>
      </ThreadGroup>
      <hashTree>

        <!-- HTTP Request Sampler -->
      
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Homepage Request" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">
            false
          </boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">
            it-314-g6-blogging-platform.vercel.app
          </stringProp>
          <stringProp name="HTTPSampler.protocol">
            https
          </stringProp>
          <stringProp name="HTTPSampler.path">
          /
          </stringProp>
          <stringProp name="HTTPSampler.method">
            GET
          </stringProp>
          <boolProp name="HTTPSampler.follow_redirects">
            true
          </boolProp>
          <boolProp name="HTTPSampler.use_keepalive">
            true
          </boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>